Revit 2024 API
RebarShapeDefinition.GetParameterDefaultValue Method
 Return the parameter's default value as stored in the definition.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2009
Syntax
C#
public double GetParameterDefaultValue(
	ElementId paramId
)
Visual Basic
Public Function GetParameterDefaultValue ( _
	paramId As ElementId _
) As Double
Visual C++
public:
double GetParameterDefaultValue(
	ElementId^ paramId
)
Parameters
paramId
Type: Autodesk.Revit.DB.ElementId
 Id of a parameter in the definition.
Return Value
 The parameter value.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  This RebarShapeDefinition does not have a value for the parameter paramId.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
RebarShapeDefinition Class
Autodesk.Revit.DB.Structure Namespace